Revit 2027 API
SpecTypeId.RotationalLineSpringCoefficient Property
 Rotational Line Spring Coefficient, in discipline Structural.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RotationalLineSpringCoefficient { get; }
Public Shared ReadOnly Property RotationalLineSpringCoefficient As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RotationalLineSpringCoefficient {
	ForgeTypeId^ get ();
}
static member RotationalLineSpringCoefficient : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace